Reports/ПланДляВнешнегоПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПланДляВнешнегоПользователя</Name>
		</Properties>
	</Report>
</MetaDataObject>

InformationRegisters/ДанныеКомплекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеКомплекта</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаНачалоТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеМонтажа</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроектирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеПроизводства</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеРКД</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеСогласования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяДатаОкончаниеТЗ</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВнешняяПродолжительностьПроизводства</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоСогласований</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Конструктор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущаяСтадияПроизводства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтадииКомплекта</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Комплект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Композиции</v8:Type>
						<v8:Type>cfg:CatalogRef.ИзделияКомплект</v8:Type>
						<v8:Type>cfg:CatalogRef.ГабаритныеЧертежи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ПланДляВнешнегоПользователя/Forms/ВозвратКДанным/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Проект = Параметры.Проект;
	ЗаполнитьГода();
	
КонецПроцедуры

Процедура ЗаполнитьГода()

	Элементы.Год.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ГОД(ДанныеКомплекта.Период) КАК Год
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект.Проект = &Проект
		|	И ВЫБОР
		|			КОГДА &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДанныеКомплекта.Автор = &Автор
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ГОД(ДанныеКомплекта.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Год";
	
	Запрос.УстановитьПараметр("Автор", 	Автор);
	Запрос.УстановитьПараметр("Проект", Проект);
	Элементы.Год.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Год"));
	Если Элементы.Год.СписокВыбора.Количество() > 0 Тогда
	
		Год = Элементы.Год.СписокВыбора[Элементы.Год.СписокВыбора.Количество() - 1].Значение; 
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьМесяца() 
	
	Элементы.Месяц.СписокВыбора.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МЕСЯЦ(ДанныеКомплекта.Период) КАК МесяцНомер,
		|	Месяцы.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Месяцы КАК Месяцы
		|		ПО (МЕСЯЦ(ДанныеКомплекта.Период) = Месяцы.Код)
		|ГДЕ
		|	ДанныеКомплекта.Комплект.Проект = &Проект
		|	И ГОД(ДанныеКомплекта.Период) = &Год
		|	И ВЫБОР
		|			КОГДА &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДанныеКомплекта.Автор = &Автор
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	МЕСЯЦ(ДанныеКомплекта.Период),
		|	Месяцы.Наименование
		|
		|УПОРЯДОЧИТЬ ПО
		|	МесяцНомер";
	
	Запрос.УстановитьПараметр("Автор", 	Автор);
	Запрос.УстановитьПараметр("Год", 	Год);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Элементы.Месяц.СписокВыбора.Добавить(Выборка.МесяцНомер, Выборка.Наименование);
	
	КонецЦикла; 
	
	Если Элементы.Месяц.СписокВыбора.Количество() > 0 Тогда
	
		Месяц = Элементы.Месяц.СписокВыбора[Элементы.Месяц.СписокВыбора.Количество() - 1].Значение; 
	
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьДни() 
	
	Элементы.День.СписокВыбора.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДЕНЬ(ДанныеКомплекта.Период) КАК День
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект.Проект = &Проект
		|	И ГОД(ДанныеКомплекта.Период) = &Год
		|	И МЕСЯЦ(ДанныеКомплекта.Период) = &Месяц
		|	И ВЫБОР
		|			КОГДА &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДанныеКомплекта.Автор = &Автор
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ДЕНЬ(ДанныеКомплекта.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	День";
	
	Запрос.УстановитьПараметр("Автор", 	Автор);
	Запрос.УстановитьПараметр("Месяц", 	Месяц);
	Запрос.УстановитьПараметр("Год", 	Год);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Элементы.День.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("День"));
	
	Если Элементы.День.СписокВыбора.Количество() > 0 Тогда
	
		День = Элементы.День.СписокВыбора[Элементы.День.СписокВыбора.Количество() - 1].Значение; 
	
	КонецЕсли;

КонецПроцедуры


Процедура ЗаполнитьЧасы() 
	
	Элементы.Час.СписокВыбора.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЧАС(ДанныеКомплекта.Период) КАК Час
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект.Проект = &Проект
		|	И ГОД(ДанныеКомплекта.Период) = &Год
		|	И МЕСЯЦ(ДанныеКомплекта.Период) = &Месяц
		|	И ДЕНЬ(ДанныеКомплекта.Период) = &День
		|	И ВЫБОР
		|			КОГДА &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДанныеКомплекта.Автор = &Автор
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЧАС(ДанныеКомплекта.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Час";
	
	Запрос.УстановитьПараметр("Автор", 	Автор);
	Запрос.УстановитьПараметр("День", 	День);
	Запрос.УстановитьПараметр("Месяц", 	Месяц);
	Запрос.УстановитьПараметр("Год", 	Год);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Элементы.Час.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Час"));
	
	Если Элементы.Час.СписокВыбора.Количество() > 0 Тогда
	
		Час = Элементы.Час.СписокВыбора[Элементы.Час.СписокВыбора.Количество() - 1].Значение; 
	
	КонецЕсли;

КонецПроцедуры


Процедура ЗаполнитьМинуты() 
	
	Элементы.Минута.СписокВыбора.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНУТА(ДанныеКомплекта.Период) КАК Минута
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект.Проект = &Проект
		|	И ГОД(ДанныеКомплекта.Период) = &Год
		|	И МЕСЯЦ(ДанныеКомплекта.Период) = &Месяц
		|	И ДЕНЬ(ДанныеКомплекта.Период) = &День
		|	И ЧАС(ДанныеКомплекта.Период) = &Час
		|	И ВЫБОР
		|			КОГДА &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДанныеКомплекта.Автор = &Автор
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	МИНУТА(ДанныеКомплекта.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Минута";
	
	Запрос.УстановитьПараметр("Автор", 	Автор);
	Запрос.УстановитьПараметр("Час", 	Час);
	Запрос.УстановитьПараметр("День", 	День);
	Запрос.УстановитьПараметр("Месяц", 	Месяц);
	Запрос.УстановитьПараметр("Год", 	Год);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Элементы.Минута.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Минута"));
	
	Если Элементы.Час.СписокВыбора.Количество() > 0 Тогда
	
		Минута = Элементы.Минута.СписокВыбора[Элементы.Минута.СписокВыбора.Количество() - 1].Значение; 
	
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьСекунды() 
	
	Элементы.Секунда.СписокВыбора.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СЕКУНДА(ДанныеКомплекта.Период) КАК Секунда
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта КАК ДанныеКомплекта
		|ГДЕ
		|	ДанныеКомплекта.Комплект.Проект = &Проект
		|	И ГОД(ДанныеКомплекта.Период) = &Год
		|	И МЕСЯЦ(ДанныеКомплекта.Период) = &Месяц
		|	И ДЕНЬ(ДанныеКомплекта.Период) = &День
		|	И ЧАС(ДанныеКомплекта.Период) = &Час
		|	И Минута(ДанныеКомплекта.Период) = &Минута
		|	И ВЫБОР
		|			КОГДА &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ ДанныеКомплекта.Автор = &Автор
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	СЕКУНДА(ДанныеКомплекта.Период)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Секунда";
	
	Запрос.УстановитьПараметр("Автор", 	Автор);
	Запрос.УстановитьПараметр("Минута", Минута);
	Запрос.УстановитьПараметр("Час", 	Час);
	Запрос.УстановитьПараметр("День", 	День);
	Запрос.УстановитьПараметр("Месяц", 	Месяц);
	Запрос.УстановитьПараметр("Год", 	Год);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Элементы.Секунда.СписокВыбора.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Секунда"));
	
	Если Элементы.Секунда.СписокВыбора.Количество() > 0 Тогда
	
		Секунда = Элементы.Секунда.СписокВыбора[Элементы.Секунда.СписокВыбора.Количество() - 1].Значение; 
	
	КонецЕсли;

КонецПроцедуры



&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Год) Тогда
		
		ЗаполнитьМесяца();
		Если ЗначениеЗаполнено(Месяц) Тогда
			ЗаполнитьДни();
			Если ЗначениеЗаполнено(День) Тогда
				ЗаполнитьЧасы();
				Если ЗначениеЗаполнено(Час) Тогда
					ЗаполнитьМинуты();
					Если ЗначениеЗаполнено(Минута) Тогда
						ЗаполнитьСекунды();
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНаСервере()

	ДатаРасчета = Дата(Год, Месяц, День, Час, Минута, Секунда); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Период КАК Период,
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.Автор КАК Автор,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоМонтажа КАК ВнешняяДатаНачалоМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроектирования КАК ВнешняяДатаНачалоПроектирования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоПроизводства КАК ВнешняяДатаНачалоПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоРКД КАК ВнешняяДатаНачалоРКД,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоСогласования КАК ВнешняяДатаНачалоСогласования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаНачалоТЗ КАК ВнешняяДатаНачалоТЗ,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеМонтажа КАК ВнешняяДатаОкончаниеМонтажа,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроектирования КАК ВнешняяДатаОкончаниеПроектирования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеПроизводства КАК ВнешняяДатаОкончаниеПроизводства,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеРКД КАК ВнешняяДатаОкончаниеРКД,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеСогласования КАК ВнешняяДатаОкончаниеСогласования,
		|	ДанныеКомплектаСрезПоследних.ВнешняяДатаОкончаниеТЗ КАК ВнешняяДатаОкончаниеТЗ,
		|	ДанныеКомплектаСрезПоследних.ВнешняяПродолжительностьПроизводства КАК ВнешняяПродолжительностьПроизводства,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(
		|			&Дата,
		|			ВЫБОР
		|					КОГДА &Автор = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ Автор = &Автор
		|				КОНЕЦ
		|				И Комплект.Проект = &Проект) КАК ДанныеКомплектаСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДанныеКомплектаСрезПоследних.Комплект.Наименование";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	Запрос.УстановитьПараметр("Автор", Автор);
	Запрос.УстановитьПараметр("Дата", ДатаРасчета);
	
	ДанныеРегистра.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	ДанныеРегистра.Очистить();
	Если ЗначениеЗаполнено(Секунда) Тогда
		
		ОбновитьНаСервере();
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДанныеРегистра.Очистить();
	ГодПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура МесяцПриИзменении(Элемент)
	ДанныеРегистра.Очистить();
	Если ЗначениеЗаполнено(Месяц) Тогда
		ЗаполнитьДни();
		Если ЗначениеЗаполнено(День) Тогда
			ЗаполнитьЧасы();
			Если ЗначениеЗаполнено(Час) Тогда
				ЗаполнитьМинуты();
				Если ЗначениеЗаполнено(Минута) Тогда
					ЗаполнитьСекунды();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДеньПриИзменении(Элемент)      
	ДанныеРегистра.Очистить();
	Если ЗначениеЗаполнено(День) Тогда
		ЗаполнитьЧасы();
		Если ЗначениеЗаполнено(Час) Тогда
			ЗаполнитьМинуты();
			Если ЗначениеЗаполнено(Минута) Тогда
				ЗаполнитьСекунды();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧасПриИзменении(Элемент)
	ДанныеРегистра.Очистить();
	Если ЗначениеЗаполнено(Час) Тогда
		ЗаполнитьМинуты();
		Если ЗначениеЗаполнено(Минута) Тогда
			ЗаполнитьСекунды();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АвторПриИзменении(Элемент)
	ДанныеРегистра.Очистить();
	ЗаполнитьГода();
	ГодПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура МинутаПриИзменении(Элемент)
	ДанныеРегистра.Очистить();
	Если ЗначениеЗаполнено(Минута) Тогда
		ЗаполнитьСекунды();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СекундаПриИзменении(Элемент)
	ДанныеРегистра.Очистить();
КонецПроцедуры

&НаСервере
Процедура УстановитьНаТекущуюДатуНаСервере()
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеКомплектаСрезПоследних.Комплект КАК Комплект,
		|	ДанныеКомплектаСрезПоследних.Конструктор КАК Конструктор,
		|	ДанныеКомплектаСрезПоследних.Приоритет КАК Приоритет,
		|	ДанныеКомплектаСрезПоследних.ТекущаяСтадия КАК ТекущаяСтадия
		|ИЗ
		|	РегистрСведений.ДанныеКомплекта.СрезПоследних(, Комплект.Проект = &Проект) КАК ДанныеКомплектаСрезПоследних";
	
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Отбор = Новый Структура("Комплект", );
	
	Пока Выборка.Следующий() Цикл
		Отбор.Комплект = Выборка.Комплект;
		НайденаяСтрокам = ДанныеРегистра.НайтиСтроки(Отбор);
		
		Если НайденаяСтрокам.Количество() > 0 Тогда
		
			ЗаполнитьЗначенияСвойств(НайденаяСтрокам, Выборка);	
		
		КонецЕсли;
		
	КонецЦикла; 
	
	МенеджерЗаписи = РегистрыСведений.ДанныеКомплекта.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Автор = ПараметрыСеанса.ТекущийПользователь;
	МенеджерЗаписи.Период = ТекущаяДата();
	
	Для каждого х Из ДанныеРегистра Цикл
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, х, , "Автор");
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	

КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаТекущуюДату(Команда)
	УстановитьНаТекущуюДатуНаСервере();
КонецПроцедуры
